征税基点=2000
税率=[(0,500,0.05),(500,2000,0.1),(2000,5000,0.15),(5000,20000,0.2),(20000,40000,0.25),(40000,60000,0.3)
    ,(60000,80000,0.35),(80000,100000,0.4),(100000,1e10,0.45)]
def 计算缴税额(剩余应缴税收入):
    税=0.0
    剩余应缴税收入-=征税基点
    总应缴税收入=剩余应缴税收入
    i=0
    for i in range(len(税率)):
        #判断缴税收入是否在当前的缴税范围内
        if (总应缴税收入>税率[i][0]):
            if (总应缴税收入>税率[i][1]):
                税+=(税率[i][1]-税率[i][0])*税率[i][2]
                剩余应缴税收入 -= (税率[i][1] - 税率[i][0])
            else:
                税+=(总应缴税收入-税率[i][0]) * 税率[i][2]
                剩余应缴税收入=0
            print('征税范围：%6d~%6d 该范围内缴税金额：%6.2f 超出该范围的金额：%6d'%(税率[i][0],税率[i][1],税,剩余应缴税收入))
    return 税
if __name__=='__main__':
    print('请输入个人收入金额：',end='')
    剩余应缴税收入=int(input())
    税=计算缴税额(剩余应缴税收入)
    print('您的个人所得税为%12.2f'%税)
