#input()#不管输入的是什么，最终返回的都是字符串
#name=input('赌神说：小家伙，请输入你的名字')
#print(value,...,sep='',end='\n')
'''
value是用户要输出的信息，后面的省略号表示可以有多个要输出的信息
sep是多个要输出信息之间的分隔符，其默认值为一个空格
end是一个print（）函数中所有要输出信息之后添加的符号，默认值为换行符
'''
print('gou ba','bian cheng','xue bu ming bai')
print(300)
print('100+200=',100+200)
print("萧炎的谜题：")
print('a','b','c','d')
print('a','b','c','d',sep=',')
print('a','b','c','d',sep=';')
print('a','b','c','d')
print('peace',22)
var1='你生来就是魔王'
var2="python pro 哥"
print('var1[0]',var1[0])
print('var2[1:5]',var2[1:5])
'''
[:]截取全部字符
[1:3]截取第一个到第三个的字符
[::-1]创造一个与原字符串顺序相反的字符串
[-3:]截取倒数第三个到结尾
'''
var1='hello 斗破苍穹！'
print('最好看的玄幻小说原来是：',var1)
print('下面开始更新字符串:',var1[:6]+'蜀山传！')
print('萧熏儿\n倾国倾城')#转义字符可以用于显示单双引号，换行续行，回车换页等功能
print('萧熏儿\\倾国倾城')
print('萧熏儿\'倾国倾城\'')
print(r'\t\r')
print('我是天赋异禀的少年武者%s,今年已经%d岁了！'%('萧炎',18))
#%s用于格式化字符串 %d用于格式化整数
#格式化即创造一段可变填词的定型文
print(1.23e9)
#科学计数法用E\e表示10的次方

